Revit 2024 API
FootPrintRoof.Overhang Property
Retrieve or set the Overhang of the curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double this[
	ModelCurve pCurve
] { get; set; }
Visual Basic
Public Property Overhang ( _
	pCurve As ModelCurve _
) As Double
	Get
	Set
Visual C++
public:
property double Overhang[ModelCurve^ pCurve] {
	double get (ModelCurve^ pCurve);
	void set (ModelCurve^ pCurve, double value);
}
Parameters
pCurve
Type: Autodesk.Revit.DB.ModelCurve
Remarks
Only applicable when the FootPrintRoof is created with Pick Walls.
See Also
FootPrintRoof Class
Autodesk.Revit.DB Namespace